# IsInternalKeynoteSchedule Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSchedule..::..IsInternalKeynoteSchedule Property
ViewSchedule Class See Also
---
Identifies if this ViewSchedule is an internal schedule used when keynotes are filtered based on the elements that are shown on a sheet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsInternalKeynoteSchedule { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsInternalKeynoteSchedule As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsInternalKeynoteSchedule {
	bool get ();
}
```

# Remarks
These schedules cannot be modified by the user or placed on sheets.
# See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace